In [1]:
import pandas as pd
import numpy as np

In [11]:
dist={'Names':['Ramesh','Suresh',,'Mahesh'],
     'Age': [31,32,33,''],
     'City':['','Hyd','Mumbai','Chennai']}
dist

NameError: name 'Null' is not defined

In [9]:
data1 = pd.DataFrame(dist)
data1

    Names Age     City
0  Ramesh  31
1  Suresh  32      Hyd
2          33   Mumbai
3  Mahesh      Chennai

In [10]:
data1.isnull()

   Names    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [1]:
<img src="https://global-uploads.webflow.com/5ef788f07804fb7d78a4127a/61caab2472ef2fac037736b1_eulidean distance-min.png" alt="Euclidean Distance - YouTube" class=" nofocus" tabindex="0" aria-label="Euclidean Distance - YouTube" role="button">

SyntaxError: invalid syntax (3547280842.py, line 1)